OpenFOAM-v2506/tutorials/incompressible/simpleFoam/squareBend/Allrun.pre
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

mkdir -p constant/triSurface

cp -f \
    "$FOAM_TUTORIALS"/resources/geometry/angledPlane.obj.gz \
    constant/triSurface

restore0Dir

runApplication blockMesh

runApplication topoSet

#------------------------------------------------------------------------------
